package djboom.tradering.server {

	import com.junkbyte.console.Cc;

	/**
	 * .
	 * <br>
	 * 
	 * @author DJ BooM 
	 * @since 15.06.2012
	 * 
	 */

	public class NetInfo {


		// ----------------------------------------------------------------------------
		// Константы класса.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Свойства класса.
		// ----------------------------------------------------------------------------

		private var _info:Object;

		private var _code:String;
		
		/**
		 * [-] 89 00:32 В NetInfo не существует свойста  level {NetInfo}
[-] 90 00:32 В NetInfo не существует свойста  details {NetInfo}
[-] 91 00:32 В NetInfo не существует свойста  clientid {NetInfo}
[-] 92 00:32 В NetInfo не существует свойста  description {NetInfo}
 * [-] 69 00:21 В NetInfo не существует свойста  application {NetInfo}
[-] 70 00:21 В NetInfo не существует свойста  level {NetInfo}
[-] 71 00:21 В NetInfo не существует свойста  objectEncoding {NetInfo}
[-] 72 00:21 В NetInfo не существует свойста  description {NetInfo}
		 */

		// ----------------------------------------------------------------------------
		// Конструктор.
		// ----------------------------------------------------------------------------

		public function NetInfo() {
		}

		// ----------------------------------------------------------------------------
		// Приватные методы класса.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Видимые методы класса.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Переопределенные методы.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Обработчики событий.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Публичные методы.
		// ----------------------------------------------------------------------------

		public function reflect():Class {
			return NetInfo;
		}



		// ----------------------------------------------------------------------------
		// Методы доступа.
		// ----------------------------------------------------------------------------

		public function set info(info:Object):void {
			_info = info;

			for (var key:String in _info) {
				try {
					this["_" + key] = _info[key];
				} catch(error:ReferenceError) {
					Cc.error("В NetInfo не существует свойста ", key, this);
				}
			}

			_code = info.code;
		}

		public function get code():String {
			return _code;
		}
	}
}