package djboom.tradering.data {

	import com.junkbyte.console.Cc;

	/**
	 * Информация об игроках.
	 * <br>
	 * 
	 * @author DJ BooM 
	 * @since 15.06.2012
	 * 
	 */

	public class Players {

		// ----------------------------------------------------------------------------
		// Константы класса.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Свойства класса.
		// ----------------------------------------------------------------------------

		private static var _playersInfo:Array;

		// ----------------------------------------------------------------------------
		// Конструктор.
		// ----------------------------------------------------------------------------

		public function Players() {
		}

		// ----------------------------------------------------------------------------
		// Приватные методы класса.
		// ----------------------------------------------------------------------------

		private static function showPlayers():void {
			Cc.info('');
			Cc.info('*******************  Игроки  ********************');
			Cc.info('');

			for each (var info:PlayerInfo in Players.playersInfo) {
				Cc.inspect(info);
			}

			Cc.info('');
			Cc.info('*******************************************************');
			Cc.info('');
		}

		// ----------------------------------------------------------------------------
		// Видимые методы класса.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Переопределенные методы.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Обработчики событий.
		// ----------------------------------------------------------------------------

		// ----------------------------------------------------------------------------
		// Публичные методы.
		// ----------------------------------------------------------------------------

		/**
		 * Получение информация об игроке по его идентификатору.
		 * 
		 * @param id:String	идентификатор игрока
		 * @return информация об игроке:PlayerInfo
		 *  
		 */


		public static function getPlayerInfo(id:String):PlayerInfo {
			if (_playersInfo.length == 0) return null;

			for each (var info:PlayerInfo in _playersInfo) {
				if (info.playerId == id) {
					return info;
				}
			}

			return null;
		}


		/**
		 * Передаем информацию об игроках
		 * 
		 * @param players:Object	Информация об игроках
		 * 
		 */

		public static function set players(users:Object):void {
			_playersInfo = [];
			
			for each (var data:Object in users) {
				var playerInfo:PlayerInfo = new PlayerInfo(data);

				_playersInfo[_playersInfo.length] = playerInfo;
			}

			Cc.addSlashCommand("players", showPlayers);
		}

		// ----------------------------------------------------------------------------
		// Методы доступа.
		// ----------------------------------------------------------------------------

		/**
		 * Возвращает информацию об игроках в массиве.
		 * 
		 * @return информация об игроках:Array
		 */

		static public function get playersInfo():Array {
			return _playersInfo;
		}
	}
}